#include "Delay.h"

/****************************************************************************

* 名称：Delayms()

* 功能：长软件延时,时间大约为1ms

* 入口参数：dly		延时参数，值越大，延时越久

* 出口参数：无

****************************************************************************/

void  Delayms(uint32  dly)

{ 
  uint32  i;
   for(; dly>0; dly--)
      for(i=0; i<9000; i++);
}



/****************************************************************************

* 名称：DelayNS()

* 功能：长软件延时

* 入口参数：dly		延时参数，值越大，延时越久

* 出口参数：无

****************************************************************************/

void  DelayNS(uint32  dly)

{  
  uint32  i;
   for(; dly>0; dly--) 
      for(i=0; i<50000; i++);
}